grblHAL/STM32F4xx/Src/serial.c
    if(!serial[SERIAL2_INSTANCE].flags.claimable || serial[SERIAL2_INSTANCE].flags.claimed)
        return NULL;

    serial[SERIAL2_INSTANCE].flags.claimed = On;


    UART2_CLK_En();

#ifdef UART2_PORT

    GPIO_InitTypeDef GPIO_InitStructure = {
        .Mode      = GPIO_MODE_AF_PP,
        .Pull      = GPIO_NOPULL,
        .Speed     = GPIO_SPEED_FREQ_VERY_HIGH,
        .Pin       = (1 << UART2_RX_PIN)|(1 << UART2_TX_PIN),
        .Alternate = UART2_AF
    };
    HAL_GPIO_Init(UART2_PORT, &GPIO_InitStructure);

#else

    GPIO_InitTypeDef GPIO_InitStructure = {
        .Mode      = GPIO_MODE_AF_PP,
        .Pull      = GPIO_NOPULL,
        .Speed     = GPIO_SPEED_FREQ_VERY_HIGH,
        .Pin       = (21 << UART2_TX_PIN),
        .Alternate = UART2_AF
    };
    HAL_GPIO_Init(UART2_TX_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = (1 << UART2_RX_PIN),
    HAL_GPIO_Init(UART2_RX_PORT, &GPIO_InitStructure);

#endif

    serial2SetBaudRate(baud_rate);

    HAL_NVIC_SetPriority(UART2_IRQ, 1, 0);
    HAL_NVIC_EnableIRQ(UART2_IRQ);

    return &stream;
}

void UART2_IRQHandler (void)
{
    if(UART2->SR & USART_SR_RXNE) {
        uint32_t data = UART2->DR;
        if(!enqueue_realtime_command2((char)data)) {            // Check and strip realtime commands...
            uint16_t next_head = BUFNEXT(rxbuf2.head, rxbuf2);  // Get and increment buffer pointer
            if(next_head == rxbuf2.tail)                        // If buffer full
                rxbuf2.overflow = 1;                            // flag overflow
            else {
                rxbuf2.data[rxbuf2.head] = (char)data;          // if not add data to buffer
                rxbuf2.head = next_head;                        // and update pointer
            }
        }
    }

    if((UART2->SR & USART_SR_TXE) && (UART2->CR1 & USART_CR1_TXEIE)) {
        uint_fast16_t tail = txbuf2.tail;           // Get buffer pointer
        UART2->DR = txbuf2.data[tail];              // Send next character
        txbuf2.tail = tail = BUFNEXT(tail, txbuf2); // and increment pointer
        if(tail == txbuf2.head)                     // If buffer empty then
            UART2->CR1 &= ~USART_CR1_TXEIE;         // disable UART TX interrupt
   }
}

#endif // SERIAL2_PORT
